{
	"@type": "imdb.api.userreviews.userreviewsfortitle",
	"base": {
		"disambiguation": "I",
		"id": "/title/tt0810913/",
		"image": {
			"height": 2048,
			"id": "/title/tt0810913/images/rm193051904",
			"url": "https://m.media-amazon.com/images/M/MV5BNjczMTU5OTUyMl5BMl5BanBnXkFtZTcwODEzNjc3Ng@@._V1_.jpg",
			"width": 1382
		},
		"title": "Jack and Jill",
		"titleType": "movie",
		"year": 2011
	},
	"paginationKey": "g4xolermtiqhejcxxxgs753i36t52q343aodr4pnb3eoqp3ec2kli5mzo4kr6d5wqufabr3r",
	"reviews": [{
		"author": {
			"displayName": "MartinHafer",
			"userId": "/user/ur2467618/"
		},
		"authorRating": 1,
		"helpfulnessScore": 0.4686693676056734,
		"id": "/title/tt0810913/userreviews/rw4693653",
		"interestingVotes": {
			"down": 5,
			"up": 12
		},
		"languageCode": "eng",
		"reviewText": "Before I get to the review, I want to talk a bit about twins. While the film is about fraternal twins (all boy/girl twins are fraternal), so many of the jokes are about identical twins and how they think and act and look alike. Fraternal twins are no more genetically similar than any brother and sister....so a lot of the act alike, think alike, feel alike jokes in the film are wrong and the only way this COULD work was if either Jack or Jill underwent sexual reassigment surgery and both were born the same gender. So, for this film, it SHOULD have been about twin boys...identical ones.\n\nAdam Sandler plays both Jack and his fraternal twin, Jill. Jill comes for a visit and is about as welcome and pleasant as Ebola. To say she is incredibly annoying is right on the mark! And, not surprisingly, Jack is annoyed by her and can't wait until this visit is complete. The audience feels pretty much the same about Jill! All the scatological jokes involving this character didn't help any!\n\n So does this film work? Good grief, no! The film is currently #38 on IMDB's infamous Bottom 100 List...and the film has set a record for most Razzie awards. This is because Adam Sandler was able to do something unprecidented...he won for Worst Actor AND Worst Actress!! In addition, it took home Razzies for Worst Picture and took home a total of 9 of these trophies!\n\nI think the reason it got so many Razzies and is rated so low is due to two things. First, the annoyance factor...Jill is so annoying and easy to hate that it's really hard to watch the film. Second, in recent years, Sandler has been in career freefall due to some very bad choices and it's become fashionable to hate his films. But is it among the worst movies I've ever seen? Not even close. An Ed Wood, Al Adamson or Willaim Grefe film would be much worse. But in the case of these filmmakers, they spent almost nothing to make a crap film...and Columbia spent a staggering $79,000,000 to make this crap! That's enough money to make an entire list of bad films!! So, while I hardly think it's among the worst films I've seen, it is, dollar for dollar, the worst...and it's a film that is completely brainless and annoying from start to finish.\n\nBy the way, a couple things saddened me about this film. I find it hard to believe that Al Pacino would appear in such an awful mess and playing a man who is infatuated with Jill AND I was annoyed to hear one of my favorite songs in the movie. I now don't know if I can ever hear \"Don't Bring Me Down\" by ELO again without thinking of this godawful film. I could, however, easily believe that David Spade, Vince Offer and Shaquille O'Neal were in this film...they were right in their element.",
		"reviewTitle": "Jill is, perhaps, one of the easiest characters to hate that I've ever seen in a film.",
		"spoiler": false,
		"submissionDate": "2019-03-02",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "TheLittleSongbird",
			"userId": "/user/ur20552756/"
		},
		"authorRating": 1,
		"helpfulnessScore": 0.666293902569915,
		"id": "/title/tt0810913/userreviews/rw2519257",
		"interestingVotes": {
			"down": 42,
			"up": 119
		},
		"languageCode": "eng",
		"reviewText": "I like comedy when it is funny. I have to admit though, apart from Punch Drunk Love, Reign Over Me, Spanglish, The Wedding Singer, 50 First Dates and Happy Gilmore I have never liked Adam Sandler. I often find his acting style irritating, his characters unlikeable and apart from five or six exceptions his films poorly written with not much point to them.\n\nAs much as I didn't think much of Little Nicky, You Don't Mess With the Zohan, Funny People and I Now Pronounce You Chuck and Larry(generally Anger Management, The Longest Yard, Click and The Waterboy I had mixed feelings on) neither of them are as painful to watch as this one. The trailer was enough to make me wish the ground had swallowed me up, and the film managed to be every bit as bad.\n\nSo why did I see Jack and Jill in the first place if I didn't like Sandler? One reason really. Al Pacino. I consider this man a great actor, and this is not just The Godfather, Dog Day Afternoon, Scent of a Woman and Carlito's Way as I consider his performance in Godfather Part II one of the all-time great male performances.\n\nWhen I saw the movie on Tinyurl, having an inkling it would be bad but Pacino would be at least decent, in my opinion this is as awful as I was hearing. This is not just Adam Sandler's worst film, but also one of the worst of the year and one of the worst I've seen recently.\n\nJack and Jill is a cheap-looking movie, with not much attention to slick editing or continuity and the lighting also manages to be dull. Of Sandler's movies, Jack and Jill is perhaps the worst-directed, because the director throughout seemed to be rushing through it. The soundtrack at best is forgettable, and doesn't seem dynamic with what's going on on screen.\n\nThe acting is awful. Adam Sandler is a big part of the film's problem. None of his characters are likable, instead they are very annoying and Sandler's performance is samey and irritating throughout. Not only that, Jill is introduced too quickly with a severe lack of build-ups, and Sandler as a woman in all honesty is not pretty, sorry I had to say.\n\nI was hoping that Al Pacino would elevate just a little bit, as he was the only redeeming quality of Gigli, another example of a bad film. Alas, he spends the entire movie looking bored, almost as if what am I doing here, and the performance reads very much of him playing himself. The cameos don't engage either, they are not funny, in fact pretty much nobody seems to have a sense of comic timing, and just come and go. Nicky Swardson fares best, surprising seeing as I don't regard him very highly either.\n\nWorse are the script, characters and story. In regards to the script and the humour, Jack and Jill fails utterly. The dialogue is atrocious, very immature and hackneyed, while the physical and visual humour just left a bad taste in the mouth. I get that it was meant to be funny and not to be exactly subtle, but the poop jokes for example got really embarrassing and left me more disgusted than amused.\n\nStory-wise, Jack and Jill lacks any kind of structure, it all feels very broken and rushed. As for the characters, they are either annoying, shallow or both, I finished the film not only not caring for them but also forgetting them.\n\nAll in all, Sandler's worst movie and one of the worst(I think only Bucky Larson: Born to be a Star, a movie I saw out of curiosity with little else to do, was worse) of a very hit-and-miss year. 0/10 Bethany Cox",
		"reviewTitle": "Ladies and gentlemen, here it is, Adam Sandler's worst movie!",
		"spoiler": false,
		"submissionDate": "2011-11-16",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "Michael_Elliott",
			"userId": "/user/ur13134536/"
		},
		"helpfulnessScore": 0.04558739337028442,
		"id": "/title/tt0810913/userreviews/rw2606250",
		"interestingVotes": {
			"down": 3,
			"up": 1
		},
		"languageCode": "eng",
		"reviewText": "Jack and Jill (2011) \n\n** (out of 4) \n\nBizarre Adam Sandler comedy has him playing the successful Jack who lives happily with his wife (Katie Holmes) and children but things take a turn for the worse when his twin sister Jill, also played by Sandler, shows up for a visit. I'll admit that I haven't seen a Sandler movie in a very long time. I grew up watching stuff like BILLY MADISON and BULLETPROOF but I don't think I've seen any of his previous dozen films. Why watch this one? Two reasons really. One was its reputation of being one of the worst movies ever made. The second reason was to see what Al Pacino was doing in a film like this. For starters, I really don't think this is one of the worst movies ever made. It's a very stupid one but then again so are most of the films that Sandler does. The entire Jill character is annoying, poorly written and Sandler really doesn't do anything to make her human, which then makes the fake tears at the end all the more pathetic. The screenplay has nothing going for it and it's so poorly written that you can't help but sit there amazed that no one in the cast questioned what they were doing. With that said, the film did make me laugh at spots. Some of the humor is just so stupid that I couldn't help but crack a smile. Sometimes the humor is so weird that I cracked a smile. I thought the non-stop cameos from famous people were also funny. I mean, we get Johnny Depp appearing here?!? Dana Carvey, Norm MacDonald, Tim Meadows, Regis Philbin, Shaq, Drew Carey, John McEnroe and countless other celebs all agreed to be in this thing. Then, there's Al Pacino. Yes, I'm sure the main reason for doing this project was money but the man has done so many great movies he has the right to do what he wants. With that said, he actually goes all out and I must admit that it was fun watching him go so crazy. He seems to be having a blast with the performance and his spoofing of Shakespeare was pretty good. Again, JACK AND JILL is a bad movie. There's no way around it but at the same time I really didn't come into it expecting something good. I pretty much walked away with what I was expecting and that's silly Sandler doing silly stuff. The bonus was Pacino.",
		"reviewTitle": "Not the Worst Ever Made",
		"spoiler": false,
		"submissionDate": "2012-05-03",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "SnoopyStyle",
			"userId": "/user/ur2898520/"
		},
		"authorRating": 2,
		"helpfulnessScore": 0.2307247624371028,
		"id": "/title/tt0810913/userreviews/rw2870273",
		"interestingVotes": {
			"down": 2,
			"up": 3
		},
		"languageCode": "eng",
		"reviewText": "Jack Sadelstein (Adam Sandler) is a successful L.A. advertising executive with wife Erin (Katie Holmes) and kids. He hates Thanksgiving when his twin sister Jill (Adam Sandler) visits.\n\nRarely do I hate a movie. I always appreciate how hard it is to get something done. So there has to be something dramatically wrong, morally repugnant, or societally damaging. As much as it was annoying the heck out of me, it didn't fall to the lowest rating. I give it one notch up from the bottom. Jack is actually functional, and I'm willing to see how Katie Holmes would screw this up. But Jill is horrible. She is ugly (on the inside). I wouldn't sit and listen to her in real life. So why should I sit and watch her on screen. Save yourself and skip this! Even if you're a die-hard Adam Sandler fan.",
		"reviewTitle": "Avoid Avoid Avoid",
		"spoiler": false,
		"submissionDate": "2013-09-15",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "kosmasp",
			"userId": "/user/ur5876717/"
		},
		"authorRating": 3,
		"helpfulnessScore": 0.06149212499615059,
		"id": "/title/tt0810913/userreviews/rw2674674",
		"interestingVotes": {
			"down": 2,
			"up": 1
		},
		"languageCode": "eng",
		"reviewText": "You should know what to expect from a \"regular\" Adam Sandler movie by now. And the people involved have that attitude towards the viewer too. The \"we-know-you-know-we-only-play-pretend\"! Wink wink! But is that enough fun for you? It's something that is tough to answer for any individual. I'm pretty sure I'd be laughing out loud if I was pre-teen watching this.\n\nBut even when it gets meta on you (Jack/Jill, you'll get it, when you watch it, if you watch it) it doesn't really work. So why and how did Al Pacino get involved? Everyone needs money, right? But he does give the whole thing gravitas. I still wasn't feeling anything particular, but he did deliver a speech towards the ending of the movie, that no one else in the cast could've made look as believable as him. And we're talking about some really messy phony message ... I wonder though how many boys/men will refer to this in the future as the beginning of a beautiful relationship ... to womens clothing!",
		"reviewTitle": "Numb",
		"spoiler": false,
		"submissionDate": "2012-09-17",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "jboothmillard",
			"userId": "/user/ur4248714/"
		},
		"authorRating": 1,
		"helpfulnessScore": 0.3195117525326103,
		"id": "/title/tt0810913/userreviews/rw2651371",
		"interestingVotes": {
			"down": 5,
			"up": 7
		},
		"languageCode": "eng",
		"reviewText": "I saw trailers, and I heard that it broke the record for most wins at the Razzies, the original record being held by I Know Who Killed Me starring Lindsay Lohan with eight wins, this got ten - the total amount of categories, so I had to see if it was really that bad, from Razzie winning director Dennis Dugan (Big Daddy, I Now Pronounce You Chuck & Larry, Grown Ups). Basically \"identitcal\" twins Jack and Jill Sadelstein grew up together as children, but as time went by it was clear that Jack was the more gifted and Jill trying to gain attention in the wrong ways, and now grown up, they hardly see each other. Jack (Razzie winning Adam Sandler) has become successful advertising executive in Los Angeles, married to beautiful Erin (Razzie nominated Katie Holmes) with two children, Sofia (Elodie Tougne) and Gary Sadelstein (Rohan Chand), and they are spending Thanksgiving together, and twin sister Jill (Razzie winning – for actress – Sandler) is visiting. Jill is needy and a passive-aggressive personality, and her irritating habits and overall presence is turning a normally calm Jack's world upside down, and she cannot help but ruin things for most people around her, because her rude comments and loud speaking. She has a list of things she wants to do before she goes back home, including an appearance on a game show, so she goes on The Price is Right, she also goes horse riding and goes on a studio tour, and as her plane ticket is open-ended she can stay as long as she wants, so she decides she will return at the end of Hanukkah. Jack is in charge with helping his client get a big name for a Dunkin' Donuts advertisement, and he is hoping to get actor Al Pacino (winning a Razzie, for playing himself), but with Jill around he is forced to have to listen to her problems too, especially while she is trying online dating. Hoping to get rid of his sister Jack decides to spruce up Jill's online dating profile, and sure enough she gets up to one hundred responses from men interested, she even goes out with a man calling himself Funbucket (Norm MacDonald), but of course he is scared off by her when they do go out. Feeling guilty, Jack decides Jill needs cheering up, and hoping that Al Pacino will be there too, he takes her to a Lakers game, and he does get to talk to Pacino, and the actor meanwhile spots and develops a crush on his sister. Jack was hoping that Jill would leave by New Year's Eve, since he and his wife and kids and planning a cruise, and his work colleagues find out that he has a twin sister, so they extend the birthday party they were throwing for him so that she is part of the celebration too, and later Pacino takes her to his place to pick her own birthday cake. The next day Jill is planning to go home, but Jack's gardener Felipe (Eugenio Derbez) takes her for some fun in the park, and Jack wants to invite her on the cruise so she is not alone on New Year's, but she doesn't want to go. Also Pacino will only agree to do the donuts commercial if he gets a date with Jill, and he was told that she will be on the cruise with the family, so Jack sees no choice but to use his identical twin status, and disguise himself as his sister to do on the date. On the date Pacino really expresses that he really cares for the real Jill, and Jack realises he does care about his sister, but he finds out that he disguised himself as her, and has gone back home to the Bronx. Jill goes into a restaurant feeling sorry for herself, and there a group of old high school classmates are there, including Monica (Razzie winning – for supporting actress – David Spade) who teases and taunts her, but Jack and family show up to support her, Jack does fight with Monica, but they all return home. Back at Jill's house they all make up, and Felipe has decorated the place to declare his love for her, she is overjoyed as someone loves her, and they embrace, and soon after Pacino shows up, in his performance swashbuckling costume to show his love too. In the end Pacino stepped down seeing that Jill is in love with someone else, but he still did do a commercial, where he is advertising and promoting Dunkaccino coffee with a rap song, but he hates it and tells Jack to destroy it and all copies. Also starring Derbez as Felipe's Grandma, Razzie nominated Nick Swardson as Todd, Tim Meadows as Ted, Allen Covert as Otto, Dana Carvey as Scrapply Puppeteer, Johnny Depp, Shaquille 'Shaq' O'Neal, Regis Philbin, Drew Carey, Michael Irvin, Jared Fogle, Dennis Dugan as Al Pacino's Standby and Rob Schneider as Alan. There are some people who like Sandler and his films, and there are some who don't, I'm sort of in-between, because I really liked Big Daddy, but some of his films are silly, and some are just bad, this is easily very bad, and he deserved his two Razzies. The acting is pretty terrible, Sandler is worst as his female character, Pacino tries to mock his serious actor image but just makes himself look like his career is dwindling, and Spade is awful also dressed as a woman, this is probably the lowest of the low for cross-dressing comedies, none of it made me laugh, none of it is original, and Jill is easily one of the most loathsome creatures on screen, don't bother with this piece of garbage, a stupid comedy. It won the Razzies for Worst Picture, Worst Ensemble for the entire cast, Worst Prequel, Remake, Rip-Off or Sequel, Worst Screen Couple for Sandler & EITHER Holmes, Pacino, OR Sandler and Worst Screenplay. Poor!",
		"reviewTitle": "Jack and Jill",
		"spoiler": true,
		"submissionDate": "2012-07-29",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "paul_haakonsen",
			"userId": "/user/ur22654354/"
		},
		"authorRating": 5,
		"helpfulnessScore": 0.11762105558763349,
		"id": "/title/tt0810913/userreviews/rw2743703",
		"interestingVotes": {
			"down": 3,
			"up": 2
		},
		"languageCode": "eng",
		"reviewText": "\"Jack and Jill\" is another of the mass-produced, generic comedies that Adam Sandler has been putting out there recently. It doesn't really distinguish itself from so many others of his movies.\n\nThat being said, then the movie isn't necessarily bad, it is just an indistinguishable movie - a plain and stereotypical comedy that he has been making for quite some time now.\n\nThe story in \"Jack and Jill\" is about an odd pair of twins, where Jill loves Jack and will do just about anything to spend time together, while Jack is ashamed of Jill and tries hard to avoid her at all costs. Having to spend time together over the holidays, it becomes a period of hardship for Jack.\n\nStory-wise, then \"Jack and Jill\" was alright, it didn't really bring anything new to the comedy genre, and it was all stuff that basically had been seen before in other movies. However, it did work out well enough and the story was entertaining from start to end.\n\nAs for laughs, well then there were a good amount of moments throughout the movie that causes laughter and smiles. I was thoroughly amused by many of the scenes in the movie.\n\nThe movie does have some good names to the cast list, but that doesn't necessarily elevate the movie out of mediocrity.\n\nFor a comedy, then \"Jack and Jill\" doesn't deliver all that it could have done, and that is a shame, because these types of comedies tend to be nice.",
		"reviewTitle": "A fairly mediocre comedy...",
		"spoiler": false,
		"submissionDate": "2013-01-27",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "tavm",
			"userId": "/user/ur11228318/"
		},
		"authorRating": 5,
		"helpfulnessScore": 0.11806431598104183,
		"id": "/title/tt0810913/userreviews/rw2519036",
		"interestingVotes": {
			"down": 14,
			"up": 5
		},
		"languageCode": "eng",
		"reviewText": "I admit it, when I first saw the trailer of this movie, I cringed especially when that Indian kid hit Adam Sandler's Jill character during the Thanksgiving dinner scene. But having just seen the whole movie myself with my movie theatre-working friend, it wasn't as bad as I'd thought especially with the many cameos of Famous People that appeared throughout the film. And yes, Al Pacino himself didn't embarrass himself too much here. And I got a kick out of what happened between Sandler and Pacino during the near-ending scenes. I mean, I knew the latter wasn't going to get another Oscar nomination here but, really, he seems to be having fun and that was infectious. So on the whole, Jack and Jill was pretty good, if not great, and I had a good time despite myself having some eye rolling moments some of the times...",
		"reviewTitle": "Seeing Adam Sandler playing Jack and Jill and watching Al Pacino playing himself was both funny and a little cringe-inducing but it wasn't too embarrassing",
		"spoiler": false,
		"submissionDate": "2011-11-15",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "edwagreen",
			"userId": "/user/ur2542703/"
		},
		"authorRating": 3,
		"helpfulnessScore": 0.3006424831772108,
		"id": "/title/tt0810913/userreviews/rw2636507",
		"interestingVotes": {
			"down": 1,
			"up": 3
		},
		"languageCode": "eng",
		"reviewText": "Foolish fanfare with Adam Sandler playing twins-a brother and a sister. The sister part required him to lisp when he spoke and to make himself heavy, homely and with a Bronx accent no less. Jill sounded just like a \"yenta\" on College Avenue.\n\nHow did Al Pacino ever get talked into doing this miserable picture? Is he so hard up for money?\n\nThe parts where both Jack and Jill ask people to convert to Judaism was insulting and totally uncalled for.\n\nThe part with Jill relieving herself after a day of Mexican food was vulgar and disturbing just to listen to.",
		"reviewTitle": "Jack & Jill Went Down A Hill With this Movie *1/2",
		"spoiler": true,
		"submissionDate": "2012-07-02",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "Gordon-11",
			"userId": "/user/ur0035842/"
		},
		"helpfulnessScore": 0.08221911853444781,
		"id": "/title/tt0810913/userreviews/rw2592486",
		"interestingVotes": {
			"down": 5,
			"up": 2
		},
		"languageCode": "eng",
		"reviewText": "This film is about two twin siblings who cannot get along with each other, until one of them is forced to be nice due to a work opportunity.\n\n\"Jack And Jill\" is such a funny film. I did not realise that Adam Sandler was playing the female twin as well, so it was a great surprise. His performance of a female character is not so feminine, and sometimes outright irritating and offensive, making Jill an unlikable character. How she manages to charm another guy is a little contrived, but it provides the laughs. The plot also emphasises on family warmth, and the ending is quite moving and satisfying.\n\nI find \"Jack And Jill\" a pleasant surprise. Though there is a fair share of share toilet humour, it is still entertaining and fun. Just don't let the number of Razzies give you any preconceptions about it.",
		"reviewTitle": "A pleasant surprise",
		"spoiler": false,
		"submissionDate": "2012-04-05",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "michaelRokeefe",
			"userId": "/user/ur0449021/"
		},
		"authorRating": 1,
		"helpfulnessScore": 0.48120731826072016,
		"id": "/title/tt0810913/userreviews/rw2517448",
		"interestingVotes": {
			"down": 15,
			"up": 26
		},
		"languageCode": "eng",
		"reviewText": "It seems that Adam Sandler thinks he is Ben Stiller, having enough money and ego to put any kind of crap on film and call it a movie. And somewhere there is a thinking that dressing over-the-top in drag is funny. Jack Sadelstein(Sandler)is a successful advertising man that is trying to wrangle Al Pacino into doing a Dunkin Donuts commercial. It would seem that a lot of this movie's budget came from the over-kill of placement and mention of products. The mild mannered Jack is about to have his world turned upside down when his twin sister Jill(Sandler)arrives for the Thanksgiving holiday. Jack and Jill of course are as different as night and day personality wise; but the physical resemblance can't be ignored. The girl from the Bronx just doesn't feel happy in sunny California, so Jack's attractive wife(Katie Holmes)recommends dating. The landscaper Felipe(Eugenio Derbez)finds chemistry with Jill. But somehow Jill ends up being used as bait to lure actor Al Pacino into doing Jack's commercial. Hard to believe, Pacino actually wants Jill...and wants her to the point of obsession. This movie is full of crude humor that doesn't seem to come across funny. Joke after joke falling flat. Then there is a scene of almost a minute of flatulence...over-the-top adolescent; but garnering the most laughter in the whole movie. Well recognized stars scattered throughout the cast: Tim Meadows, Norm MacDonald, David Spade, Dana Carvey, Regis Philbin, John McEnroe, Shaq O'Neil, Michael Irvin, Christie Brinkley and Johnny Depp. Pacino is a total hoot barely beating Holmes as the movies bright spot. If you happen to be a Sandler fan, you will probably bust a gut.",
		"reviewTitle": "Loud, stupid and flatulent.",
		"spoiler": true,
		"submissionDate": "2011-11-12",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "bevo-13678",
			"userId": "/user/ur76062573/"
		},
		"authorRating": 10,
		"helpfulnessScore": 0.1876166936607192,
		"id": "/title/tt0810913/userreviews/rw5894817",
		"interestingVotes": {
			"down": 3,
			"up": 3
		},
		"languageCode": "eng",
		"reviewText": "One of Adam Sandlers worst movies and that's saying something. I watched it on the telly. The best bit was when they stopped the show and went to a breaking news broadcast.",
		"reviewTitle": "Adam Sandler at his best",
		"spoiler": false,
		"submissionDate": "2020-07-10",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "zardoz-13",
			"userId": "/user/ur2079400/"
		},
		"authorRating": 1,
		"helpfulnessScore": 0.48759055605329626,
		"id": "/title/tt0810913/userreviews/rw2519716",
		"interestingVotes": {
			"down": 13,
			"up": 24
		},
		"languageCode": "eng",
		"reviewText": "Inevitably, most popular comedians at some point in their careers cross-dress for a laugh. Robin Williams, Eddie Murphy, Tyler Perry, and Martin Lawrence have donned women's apparel and kept audiences in stitches with their audacious antics. \"Little Nicky\" star Adam Sandler has finally followed their footsteps, but his antics in a dress, wig, hose, and heels are nothing but a drag. In his latest and lackluster comedy, \"Big Daddy\" director Dennis Dugan's \"Jack and Jill,\" Sandler plays identical Jewish brother and sister Jack Sadelstein and Jill Sadelstein. Jack is a married, well-to-do advertising executive who produces television commercials, while Jill is his passive-aggressive spinster sister who still lives alone in the Bronx. She embarks on her annual Thanksgiving visit to Los Angeles, and Jack counts the hours down to her departure. Predictably, before his obnoxious sister leaves, Jill turns Jack's life head-over-heels. Sadly, Dugan and Emmy nominated scribe Steve Koren, with Sandler contributing, have contrived the least offensive but also the least hilarious Sandler comedy. This lowest-common-denominator farce boasts the usual bowel humor. The adolescent counterparts of our hero and heroine blow bubbles in the bathtub. No, those bubbles have nothing to do with soapy Mr. Bubble. So skeletal is the plot in \"Jack and Jill\" that this farce yields few laughs.\n\nYou might even say Sandler is suffering from a humor tumor. Indeed, the best things about \"Jack and Jill\" have nothing to do with Sandler's cross-dressing exploits. The funniest parts are the pre-credit and post-credit scenes of actual twins talking about themselves. These scenes are nothing short of brilliant. Vaguely, this recalls a similar story strategy in the Rob Reiner movie \"When Harry Met Sally.\" Aside from these scenes which have no narrative linkage to the plot, the only other notable thing about \"Jack and Jill\" is Al Pacino. Clearly, Pacino must have wanted to get his funny bone on because he has a field day not only playing himself as a cantankerous actor but also stealing the show from Sandler. As usual, all of Sandler's \"Saturday Night Live\" collaborators--David Spade and Nick Swardson--as well as friends turn up in bit parts, even \"Pirates of the Caribbean\" superstar Johnny Depp puts in a cameo. Unfortunately, \"Jack and Jill\" never conjures up the frantic hilarity of earlier Sandler sagas such as \"Big Daddy,\" \"Happy Gilmore,\" and \"The Waterboy.\" The predicament Jack contends with in \"Jack and Jill\" isn't so much his sister's annual visit but his most prosperous client's outrageous demand. Dunkin' Donuts has singled out a specific celebrity for their next commercial. Nothing about the product placement in \"Jack and Jill\" is remotely subtle. The company wants \"Godfather\" actor Al Pacino to pitch their latest coffee flavor, the 'Dunkaccino.' If you aren't rolling your eyes up in agony at this plot, \"Jack and Jill\" may be your kind of movie. If he cannot land Pacino, Jack stands to lose the Dunkin' account. No sooner has Jill arrived than Pacino sets out to court her. He spots her at a Lakers' basketball game that Johnny Depp attends. He sends her a hot dog with his name and number on it. Initially, Jill isn't too sure about Pacino, but they date. Most of the humor in \"Jack and Jill\" is the mild, amusing stuff that might have alienated audiences back in the 1950s. Remember, this is a kiddie friendly PG-rated Sandler epic so nothing really obnoxious happens and the happily-ever-after ending is nothing short of schmaltzy. Meantime, Dugan and company throw in a subplot about a lovable Hispanic gardener (Mexican comic Eugenio Derbez) who is always kidding everybody, including Jill. He has his eyes on Jill, too. An infatuated Pacino doesn't throw in the towel easily. The biggest surprise is when Jack decides to masquerade as Jill to land Pacino. This is about the time that our hero realizes that his heart is in his wallet and he changes course.\n\nAl Pacino skewers himself with glee. During a Broadway performance of Shakespeare, Pacino hears a cell phone ringing and suffers a meltdown. Later, during another performance, he discovers that the cell phone ringing is his own! While he is dating Jill, Pacino talks about an opportunity to play Don Quixote. The pay-off scene has Pacino dressed as Quixote tilting with a ceiling fan. Pacino is genuinely funny because he isn't trying to be funny. The same cannot be said for Sandler. His farcical female impersonation act falls flat. He plays Jill as if he were in an amateur talent act. It doesn't help matters that both twins are rather colorless as characters. Meanwhile, Pacino isn't the only celebrity in sight. Indeed, John McEnroe, David Spade, Shaquille O'Neal, Drew Carey, Christie Brinkley, Michael Irvin, Regis Philbin, Dana Carvey, and even \"Subway Sandwich\" pitchman Jared Fogle participate in this pabulum. None of these stars can salvage this silly, shallow, second-rate slapstick that relies on hopeless stereotypes and obvious pratfalls. The ending with Pacino and Jack watching the \"Godfather\" Dunkin' commercial is the best thing about \"Jack and Jill.\" After Pacino watches the commercial, he tells Jack that nobody can see it. Pacino might well have been talking about \"Jack and Jill.\" Altogether, \"Jack and Jill\" yields few laughs.",
		"reviewTitle": "Talk About A Drag!",
		"spoiler": true,
		"submissionDate": "2011-11-17",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "Boba_Fett1138",
			"userId": "/user/ur1416505/"
		},
		"authorRating": 4,
		"helpfulnessScore": 0.025679698293585445,
		"id": "/title/tt0810913/userreviews/rw2529331",
		"interestingVotes": {
			"down": 6,
			"up": 1
		},
		"languageCode": "eng",
		"reviewText": "Honestly, with its comedy this movie is not any better or worse than the average modern genre attempt but the one thing that does make this movie worse is the entire way it got told and made.\n\nThe one thing with this movie that kept bugging me was that it felt like a couple of loose shot scenes, that weren't really connected by a story. It's like they went ahead and shot this movie before there even was a script ready. It's weird and it makes the movie feel like such an incomplete one.\n\nBut other than that, is the humor more lame or childish when compared to other similar genre movies? And is the Jill character really more obnoxious, irritating and unconvincing than any other forced comedy characters? Not really. As a matter of fact, the movie its humor and characters didn't bother me all that much. It's a comedy, so of course everything is being over-the-top. When you go along with that, it's not all that bad of a ride. It might even make you chuckle a couple of times.\n\nOne of the things that also really makes the movie worthwhile is Al Pacino as himself. You perhaps would expect his role to be no bigger than a cameo but as a matter of fact he is essential to the 'story' and you could even see he plays the second biggest and most important role out of the movie because Jack and Jill are both being played by the same actor, Adam Sandler, of course. And yes, Al Pacino was quite awesome in this. Most of the movie its best moments involve him and he plays his role very Pacino-like, so all serious and with all of his talents and skills.\n\nIt's really too bad he wasn't in a better movie than this one. None of the developments or backgrounds really work out for its story or any of its characters. Because of this also a lot of characters are making a very redundant impression in the movie, such as Jack's wife and kids. And his wife is actually being played by Katie Holmes but her role is hardly important at all for the movie.\n\nIt's far from the worst movie I have ever seen, it just is not a very well made one.\n\n4/10 \n\nhttp://bobafett1138.blogspot.com/",
		"reviewTitle": "Not necessarily bad because of its humor but more because of the way it's constructed.",
		"spoiler": false,
		"submissionDate": "2011-12-08",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "neil-476",
			"userId": "/user/ur7813355/"
		},
		"authorRating": 5,
		"helpfulnessScore": 0.06149212499615059,
		"id": "/title/tt0810913/userreviews/rw2563177",
		"interestingVotes": {
			"down": 2,
			"up": 1
		},
		"languageCode": "eng",
		"reviewText": "Jack is a successful advertising executive living in Los Angeles with his young family. Jill, his twin sister, has looked after their mother in The Bronx until Mom's recent death. She comes to stay with Jack for her annual holiday: unfortunately, while Jill thinks the world of Jack, she rubs him up the wrong way and they always fight. Add in to this that Jack needs to persuade Al Pacino to do a cheesy commercial for Dunkin' Donuts, and that Al Pacino forms an attachment with Jill due to their shared Bronx background...\n\n... oh, and that both Jack and Jill are played by Adam Sandler...\n\nMy habit is to come clean about reservations I have before seeing a film, and Adam Sandler is one of those. I do believe that the man has some ability as a performer, it just seems that I mostly dislike what he does: he leans heavily towards the crass, the ugly, the crude and the sentimental. Yet I recognise that his offerings find a market.\n\nWatching this film in a movie theatre with a moderate audience was an education. The film starts with a selection of twins giving on-camera interviews, and that section is quirky and entertaining. Then we meet Jack and discover how unpleasant he is. Then Jack meets Jill at the airport and we discover why she drives him up the wall (these sections seemed to amuse the young element of the audience: I sat there stony faced, and marvelled at the product placement). Then there is some schtick and they quarrel. Then there is some schtick and they quarrel. Then there is some schtick and they quarrel. At some point Al Pacino gets sucked into it. At one point Sandler is in drag playing himself as a man in drag imitating himself as a female in drag. There is (surprise surprise) a sentimental feelgood ending.\n\nI would have thought that this film was completely horrible had there not been a few things which redeemed it slightly. One is that there was no bad language - it is, I think, aimed at families although I doubt whether I personally would regard it as a suitable family film. Two, it was good to see Al Pacino slumming it and happily ripping into his established screen persona. Three, the effects which placed two Sandlers on screen at the same time were well done. Four, a fart sequence proved to be reliably funny. And, five. there were some laughs elsewhere. These usually arose from little quirky touches, like Sandler's adopted son of Indian origin who, for no apparent reason, tapes things - including small animals - to his body. That made me chuckle: little else did, and even the laughter in the cinema didn't last beyond the first half hour.\n\nOh, and after this and the forgettable \"horror\" she was in a few months ago, Katie Holmes needs to rethink her comeback game plan.",
		"reviewTitle": "If you are not an Adam Sandler fan, this film will not make you one",
		"spoiler": true,
		"submissionDate": "2012-02-09",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "Wizard-8",
			"userId": "/user/ur0101706/"
		},
		"helpfulnessScore": 0.1876166936607192,
		"id": "/title/tt0810913/userreviews/rw2583470",
		"interestingVotes": {
			"down": 3,
			"up": 3
		},
		"languageCode": "eng",
		"reviewText": "I've found that a little Adam Sandler goes a long long way. With \"Jack and Jill\", we get more Adam Sandler than anyone would want. This is a movie that was ill-conceived right from the start. It starts off with a montage of real life identical twins talking about twins - when the bulk of the movie is about the relationship between two FRATERNAL twins! It just gets worse from there. The movie makes the big mistake of making the character of Jill not only obnoxious, but unfunny and without any exposure to a sympathetic side to her character. Jill is so grating and overbearing that you can't believe that Jack's wife and children think good of her. The movie is just Jill's obnoxiousness over and over, so much so that I think that even some die hard Adam Sandler fans will turn off their televisions before the end. Also, like other Sandler movies, there are some blatant product plugs on display.\n\nI used to think that \"Bucky Larson: Born To Be A Star\" was the worst movie of 2011. After seeing \"Jack and Jill\", I'm not so sure anymore.",
		"reviewTitle": "No surprise - it's as bad as you've heard",
		"spoiler": false,
		"submissionDate": "2012-03-19",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "anaconda-40658",
			"userId": "/user/ur60028700/"
		},
		"authorRating": 1,
		"helpfulnessScore": 0.2504588219068547,
		"id": "/title/tt0810913/userreviews/rw3395374",
		"interestingVotes": {
			"down": 3,
			"up": 4
		},
		"languageCode": "eng",
		"reviewText": "Jack and Jill (2011): Dir: Dennis Dugan / Cast: Adam Sandler, Katie Holmes, Al Pacino, Nick Swardson, Tim Meadows: One joke farce where the budget seems blown on buying a dress and makeup for Adam Sandler who plays twin siblings of the opposite sex. The title is about the height of creativity. Jack is a family man who reluctantly invites his twin sister over for the holiday and as predictable formulas go they do not see eye to eye despite being so much alike. It is obvious that Jill will drive Jack crazy but not nearly as much as the film drove me crazy. The plot is simple and its big joke of Sandler in drag is not as inspiring or as funny as the film's makers wish for us to believe. Sandler and director Dennis Dugan have collaborated numerous times and only You Don't Mess With the Zohan is their best at this time. Sandler has done well in both comedies and even dramatic pictures such as Punch Drunk Love but throwing a wig, dress and makeup on him makes him look more creepy than funny, and throwing his voice is phony. Katie Holmes as Jack's wife is standard support centre and one dimensional. Al Pacino takes a real risk playing himself falling head over heels for Jill. Jack seeks Pacino for a commercial he is putting together and Pacino seems to be laughing at himself. His final scene at a restaurant is over the top but we shouldn't expect a Godfather type performance here. Then we have a slew of other Sandler regulars fitting in with the foolishness. All in all this film is devoid in laughs rendering Sandler, not Jack, to fall down and break more than his crown. Score: 1 ½ / 10",
		"reviewTitle": "Jack and Jill Went Up the Hill to Fetch a Pail of Shame.",
		"spoiler": true,
		"submissionDate": "2016-01-14",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "FlashCallahan",
			"userId": "/user/ur22668817/"
		},
		"authorRating": 5,
		"helpfulnessScore": 0.08221911853444781,
		"id": "/title/tt0810913/userreviews/rw2534024",
		"interestingVotes": {
			"down": 5,
			"up": 2
		},
		"languageCode": "eng",
		"reviewText": "So yes the film is awful, but Sandler must be doing something right because look at the box office for this.\n\nBut it's nowhere near as bad as what the critics or other users on this site are stating.\n\nThe film does have no plot though or no fluid narration. What there is of a plot goes like this. Sandler runs an advertising agency, they may close down unless they get Al Pacino to star in a commercial.\n\nJill comes to town, Pacino falls in love with her. Thats it.\n\nBut thanks to Pacino, the film is one of those wondrous creations like The Room, or Troll 2, which are awful, but have so much longevity about them, they demand to be watched.\n\nPacino is extraordinary in this, and if it was just a normal actor playing a character, it would be one of the worst movie ever made.\n\nThe film becomes funny whenever Pacino is on screen, because Pacino knows how to be self deprecating and he knows how to overact.\n\nSandler doesn't overdo the Pacino bit though, but doesn't focus on the rest of the film sadly. The rest is devoid of humour, but not atrocious stuff, because you can watch it in awe.\n\nDepp gets asked if he was in Duran Duran and he says yes, and admittedly, the last three minutes are the funniest thing i've seen all year.\n\nMaybe Pacino and Sandler were watching a rough cut of this movie when Pacino says 'this must never be seen'.\n\nThanks to you guys who have lambasted this movie on IMDb, this will becomes Sandlers cult movie, the movie people will be watching in years to come.\n\nEgg on your face for the haters, I think they bumped the box office up...",
		"reviewTitle": "Caramel swirl....I knew it was you....",
		"spoiler": true,
		"submissionDate": "2011-12-18",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "phd_travel",
			"userId": "/user/ur22484170/"
		},
		"authorRating": 7,
		"helpfulnessScore": 0.20751038315964845,
		"id": "/title/tt0810913/userreviews/rw2552009",
		"interestingVotes": {
			"down": 13,
			"up": 8
		},
		"languageCode": "eng",
		"reviewText": "I read the bad reviews about how annoying it was but it wasn't annoying. The basic premise has potential - maybe Jill could have been funnier but there are quite a lot of laughs about siblings and twins. The writing doesn't have Farrelly Brothers originality and bite.\n\nWhat you probably don't expect to get it Al Pacino in a major comical role as himself. That alone is worth watching. There is some toilet humor but no more than in Eddie Murphy comedies.\n\nAdam Sandler doesn't try too hard to be a woman. The blending of the 2 in the same scene is quite good. Kate Holmes doesn't have a lot of lines - it could have been anyone in her role. The kids aren't memorable.\n\nOverall don't expect too much and you'll be surprised there are some laughs from beginning to end. There are too many action movies out there so see it and support comedies instead.",
		"reviewTitle": "Ignore the bad reviews - it's got quite a few laughs plus Al Pacino",
		"spoiler": false,
		"submissionDate": "2012-01-20",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "namashi_1",
			"userId": "/user/ur8503729/"
		},
		"authorRating": 6,
		"helpfulnessScore": 0.1368445653289135,
		"id": "/title/tt0810913/userreviews/rw2567891",
		"interestingVotes": {
			"down": 5,
			"up": 3
		},
		"languageCode": "eng",
		"reviewText": "'Jack and Jill' works primarily for 2 reasons: Al Pacino & Adam Sandler. Pacino pitches in a Fantastic, Unforgettable Performance, while Sandler takes up 2-roles, and delivers a really sporty & relaxed performance.\n\n'Jack and Jill' Synopsis: Family guy Jack Sadelstein prepares for the annual event he dreads: the Thanksgiving visit of his twin sister, the needy and passive-aggressive Jill, who then refuses to leave.\n\nAs a film, 'Jack and Jill' will work for those who love over-the-top comedies. Its strictly NOT meant for the pseudo intellectuals, who only have an appetite for Hardcore-Serious Cinema. I won't say I loved this comedy, but I definitely didn't hate it either. Come on, you're not meant to take this film seriously, its meant to make you laugh, that's it! \n\nBen Zook, Steve Koren & Robert Smigel's Screenplay is over-the-top, but funny at times nevertheless. Dennis Dugan's Direction, is fair. Cinematography, Editing & Art Design, are functional.\n\nPacino is truly Unforgettable in here. The Emperor of Acting delivers a load of laughs, thanks to his Fantastic Comic-Timing & Undeniably Screen-Presence. Sandler, on the other-hand, delivers a very relaxed & sporty performance. He's good as Jack & completely \"fun\" as Jill. Among other performances, Katie Holmes is her usual self. In cameo roles, Johnny Depp & Shaquille O'Neal are Superb.\n\nOn the whole, 'Jack and Jill' is funny in parts. Watch it for Pacino & Sandler's Winning Performances.",
		"reviewTitle": "Watch It For Al Pacino & Adam Sandler!",
		"spoiler": false,
		"submissionDate": "2012-02-18",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "Smells_Like_Cheese",
			"userId": "/user/ur1293485/"
		},
		"authorRating": 1,
		"helpfulnessScore": 0.3627594248528129,
		"id": "/title/tt0810913/userreviews/rw2639161",
		"interestingVotes": {
			"down": 8,
			"up": 11
		},
		"languageCode": "eng",
		"reviewText": "Think back to the 90's with Adam Sandler, he was a writer/performer on SNL and had several hit movies. Back in the day, his baby sounds and squished faces were not only cute but hilarious. Now, like all humans, he gets older, but mentally is stuck in the 90's where people found his movies very funny. Now, the strange thing is, Adam Sandler has proved a couple of times that he could be a good dramatic actor. I'm not sure why he hasn't moved on\u0085 probably because his best friends are desperate for money and he's got to keep his dumb movie company \"Happy Madison\" going, so naturally he writes a bad story with predictable jokes and for some reason he thinks he's so funny, so naturally the movie somehow gets green lighted and that leads us to Jack and Jill. I was warned several times that this movie was awful, but one of my friends wanted to see this movie and rented it. She begged me to watch it with her and told me that I should keep an open mind\u0085fair enough, right? I was thinking I was too close minded and I should let go and just have a good laugh. So during the movie, my expression did not change, I just couldn't laugh at anything\u0085I look over and my friend is laughing hysterically. Why am I not having the same reaction? I don't know, but I guess I'm one of the rare people that are seeing the down fall of society with Sandler's movies.\n\nJack, a successful advertising executive in Los Angeles with a beautiful wife and two kids, Sofie and Gary. Jack is incredibly irritated about the Thanksgiving visit of his \"identical\" twin sister Jill. Following a series of problems from the airport to the house, Jack's patience is soon stretched increasingly thin. Jill's neediness and passive-aggressiveness is maddening to Jack, turning his normally tranquil life upside down. Jill says she has a list of things she wants to do before she leaves; she wants to be on a game show, go horseback riding, and do a studio tour. Meanwhile, Jack's client wants him to get Al Pacino to appear in a Dunkin Donuts commercial. Jill tries online dating, but doesn't get much of a response until Jack alters her profile, leading her to get over 100 responses. Jack feels bad so he takes her to the Lakers game where Al Pacino is supposed to be. He is there and he develops a crush on Jill as he gives her his phone number. Now the commercial is dependent on her taking a liking to Al Pacino.\n\nOne thing that I wonder: what the heck did Adam Sandler do to these celebrities who make a cameo in the film? Johnny Depp, one of the greatest actors of our generation makes a cameo. Shaq\u0085well, I withdraw my question on that one. But Al Pacino, did Adam Sandler take a picture of the guy luring children into his gingerbread house or something? But given credit where it's due, Al seems to be the only one putting any effort into this movie. Adam Sandler's character of Jill is very close in the running for most obnoxious characters in cinema history. What I don't get is how in this universe that anyone can stand her? She's loud, racist, crude, ugly and just plain annoying, yet somehow people defend her and somehow 2 guys get a crush on her?! Plus I love how in every Sandler movie now that he writes, his character is: successful, \"good-looking\", has a gorgeous wife, smart, witty and everyone just admires him of course. This movie in itself is a big joke and I really tried to enjoy myself, but just have to go with the negative reviews on this film, it really is that bad. As for people like other users and my friend who found it funny, try watching other movies. I promise, there's a whole world of comedy out there that is much better than this.\n\n1/10",
		"reviewTitle": "God, Adam Sandler is so in love with himself! Why not just call the film Adam Sandler, Adam Sandler, Adam Sandler and Adam Sandler dresses and acts like an obnoxious troll?",
		"spoiler": true,
		"submissionDate": "2012-07-08",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "Hellmant",
			"userId": "/user/ur15977902/"
		},
		"authorRating": 1,
		"helpfulnessScore": 0.11762105558763349,
		"id": "/title/tt0810913/userreviews/rw2579806",
		"interestingVotes": {
			"down": 3,
			"up": 2
		},
		"languageCode": "eng",
		"reviewText": "'JACK AND JILL': A Half a Star (Out of Five) \n\nAdam Sandler for the majority of his career (in which he's been the most bankable star in Hollywood, for the majority of it) has consistently made crappy movies (with the exception of a few good ones like 'FUNNY PEOPLE', 'PUNCH-DRUNK LOVE' or 'HAPPY GILMORE' here and there) and they seem to be only getting worse. He certainly has never reached as low as he has with this film and I hope he can't go any lower. The funniest thing about it though is his films all (including this one) are huge box-office hits (except for the good ones, like the ones I mentioned). They all make over a $100 million a piece and huge profits. He's only making the films that people want to see, is what's the most ridiculous thing about it. Which proves that people love crappy movies. They may say they don't (and make fun of movies like this) but they keep getting made because people love handing over their money to see them.\n\nIn this one Adam Sandler plays identical twins Jack Sadelstein and Jill Sadelstein and the one joke premise revolves around the idea that Jack can't stand his annoying and grotesque sister when she comes to visit him and his family for the holidays each year. This time it turns in to an extended visit and Jack goes crazy trying to get rid of his sister. The craziest thing about the story is that Al Pacino plays himself as a crazed stalker who falls madly in love with Jill but Jill, despite always repelling men, isn't into the millionaire superstar. This drives Jack even crazier as he's been trying to secure a business deal with Mr. Pacino.\n\nThe movie is insane! It's one of the most painful experiences I've ever had watching a movie. The premise of the movie, in one effect, works because we as viewers experience fully how crazy Jack is going by having to put up with Jill but it's never funny. It's just disgusting and annoying. Sandler used to be funny and this is what he's seriously trying to pass as comedy these days. Honestly I don't seriously think he believes it's funny though. He knows it's crap but he knows that's what people want. He is a genius comedian but even more so he's a genius businessman and that's why he's the biggest star in Hollywood. He knows how to make a money making hit every single time. He produced the movie, wrote it (if you can call it that) with his buddies Steve Koran and Ben Zook, cast a bunch of his friends in it and hired his director friend Dennis Dugan (who directs most of his films) to direct. He made the movie for $79 million by allowing himself and his friends to pocket most of the money and put almost no effort into making a quality film because he knew it wouldn't matter. The studio still made a huge profit and everyone involved is happy. It seems the biggest joke is on all the viewers who paid to go and see it; Sandler is messing with everyone and getting richer and richer in the process. That's a genius comedian!\n\nWatch our movie review show 'MOVIE TALK' at: http://www.youtube.com/watch?v=ioQaCI5Qk34",
		"reviewTitle": "A genius comedian!",
		"spoiler": false,
		"submissionDate": "2012-03-07",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "thesar-2",
			"userId": "/user/ur17825945/"
		},
		"authorRating": 1,
		"helpfulnessScore": 0.1368445653289135,
		"id": "/title/tt0810913/userreviews/rw2569256",
		"interestingVotes": {
			"down": 5,
			"up": 3
		},
		"languageCode": "eng",
		"reviewText": "The most surprising thing about the anti-comedic Jack and Jill was that I didn't hate it. The least surprising thing was that I didn't laugh.\n\nMuch like a small town with an accused murderer everyone knows and it's tough for a jury not to have a set opinion if the trial doesn't change its venue, it would be even harder not to go into this movie without preconceived notions as this movie has been used as toilet paper by more critics than even Twilight. Still, I try my best to have an open mind and every movie has its fresh slate as it begins.\n\nOh, don't get me wrong, by the end of the film – along with it's terrible bookended \"Twin\" coming out stories, as if twins are the new gays – I was not pleased either. It sure was awful and all jokes, if you can call them those, appeared to miss the mark by a six-hour flight. It was almost as if they started with the premise \"What if we can get Al Pacino play himself and ask the audience why he only has one Oscar\" and blindly wrote the script around that.\n\nThe film had ancient ideas wrapped in clichés and bad characters with even worse dialogue. I'm guessing here, and I think the obvious finale will back me up, we're supposed to care about the obnoxious and sad Jill, but it didn't happen. Make that nothing happened to make us care about anyone. Even Adam Sandler's Jack looked bored, confused and tired thorough.\n\nHow could he possibly think this was a good idea? Or any of the dozens of cameos? And if I may, I can understand Al Pacino is doing everything (and any project) he can to stay in the limelight, but poor once-great Johnny Depp. I think Johnny just gave up. He said he's made his billions did enough fantastic projects and now will just stop all what made him grand once. (SEE: The Tourist and Pirates 3-4.)\n\nThe basic plot, and yeah, it's flat-basic, is yearly visitor Jill overstays her unwelcome by her twin, Jack. But, wait! If Jack can get Jill to date Al Pacino, he'll star in a Dunkin Donuts ad and Jack won't lose his biggest client.\n\nThis micro-thin Three's Company lost episode was sad before it began and it appears even Adam Sandler realized it. The puns were lazy, juvenile – and not in the typical Sandler fashion, I really mean a kid wrote them – and were never said with any conviction. And Al Pacino apparently was repeating his Colonel Frank Slade from Scent of a Woman if he would fall for Jill – she wasn't just obviously ugly outside, she was a beast inside, as well.\n\nSome movies are so bad they NEED to be seen, such as The Room, Birdemic: Shock and Terror or Troll 2. Mostly for curiosity reasons. After you read my 10-second plot synopsis, you need not spend another hour and half wasting your way through female Adam Sandler falling down or male Adam Sandler looking more indifferent and sad than frustrated.",
		"reviewTitle": "Jack & Jill, Here's My Bill",
		"spoiler": true,
		"submissionDate": "2012-02-20",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "Edvis-1997",
			"userId": "/user/ur64160263/"
		},
		"authorRating": 5,
		"id": "/title/tt0810913/userreviews/rw4497723",
		"languageCode": "eng",
		"reviewText": "Meh average movie about nothing it's really disappointing for Sandler.",
		"reviewTitle": "5",
		"spoiler": false,
		"submissionDate": "2018-12-06",
		"titleId": "/title/tt0810913/"
	}, {
		"author": {
			"displayName": "bowmanblue",
			"userId": "/user/ur1406466/"
		},
		"authorRating": 1,
		"helpfulnessScore": 0.2537819768063609,
		"id": "/title/tt0810913/userreviews/rw3019199",
		"interestingVotes": {
			"down": 6,
			"up": 6
		},
		"languageCode": "eng",
		"reviewText": "Okay, so I'm not Adam Sadler's biggest fan. His films are hit and miss in my opinion, but I'm always willing to give them a go (I did recently enjoy Funny People). However, this is one time when I should have researched a film before I watched it. If you look at the online reviews you'll see what I mean.\n\nThe other thing I should point out is that my 'review' is only based on the first half an hour. That was all I could stand. I'm sorry. I hope I'm not doing this film a massive disservice by not watching it in its entirety. Perhaps it really picked up and I missed some real comic gold. However, from the opening act, I really don't think so.\n\nAdam Sadler plays two roles - twins Jack and his 'identical' sister Jill. Jill comes to stay with his family and 'hilarity' results. Unfortunately, Jill is the most annoying character ever to grace cinema screens. I know what you're thinking - you're thinking that you've seen the Phantom Menace and that no one can top Jar Jar Binks. Wrong! Seriously, it's like Jar Jar has had a baby with Ruby Rhod from the Fifth Element and produced Jill. All she does is shriek on and on, in between generally being rude and stupid and insensitive towards anyone who is unlucky enough to get near her.\n\nNow, I have nothing against annoying characters in films. If a character is annoying then that's part of who they are. My problem with Jack and Jill is how other characters deal with them. If we meet someone annoying, we stay well clear. However, in this film everyone extends her too much courtesy to make it believable. Yes, I know she's family, but even so, you wouldn't let her anywhere near you if you know what she's like. Yet, everyone makes massive allowances for her, even berating her long-suffering twin brother Jack (who is pretty unlikeable in himself) for not being nicer to her.\n\nIn short, there is not a rating low enough to describe this rubbish. Do not watch it, it's truly that bad. The only thing vaguely interesting about it is how they persuaded Al Pacino to appear in it. Does he really need the money that badly?\n\nhttp://thewrongtreemoviereviews.blogspot.co.uk/",
		"reviewTitle": "This film needs a warning label on it",
		"spoiler": false,
		"submissionDate": "2014-05-20",
		"titleId": "/title/tt0810913/"
	}],
	"totalReviews": 410
}